RT-Thread/rt-thread/bsp/apm32/libraries/APM32F10x_Library/APM32F10x_StdPeriphDriver/src/apm32f10x_emmc.c
/*!
 * @file        apm32f10x_emmc.c
 *
 * @brief       This file provides all the EMMC firmware functions
 *
 * @version     V1.0.2
 *
 * @date        2022-01-05
 *
 * @attention
 *
 *  Copyright (C) 2020-2022 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32f10x_emmc.h"
#include "apm32f10x_rcm.h"

/** @addtogroup Peripherals_Library Standard Peripheral Library
  @{
*/

/** @addtogroup EMMC_Driver EMMC Driver
  @{
*/

/** @addtogroup EMMC_Fuctions Fuctions
  @{
*/

/*!
 * @brief     Rest the EMMMC NOR/SRAM Banks registers
 *
 * @param     bank: Selects the EMMMC Bank.
 *                  The parameter can be one of following values:
 *                  @arg EMMC_BANK1_NORSRAM_1: EMMC Bank1 NOR/SRAM1
 *                  @arg EMMC_BANK1_NORSRAM_2: EMMC Bank1 NOR/SRAM2
 *                  @arg EMMC_BANK1_NORSRAM_3: EMMC Bank1 NOR/SRAM3
 *                  @arg EMMC_BANK1_NORSRAM_4: EMMC Bank1 NOR/SRAM4
 *
 * @retval    None
 */
void EMMC_ResetNORSRAM(EMMC_BANK1_NORSRAM_T bank)
{
    /** EMMC_BANK1_NORSRAM_1 */
    if(bank == EMMC_BANK1_NORSRAM_1)
    {
        EMMC_Bank1->SNCTRL_T[bank] = 0x000030DB;
    }
    /** EMMC_BANK1_NORSRAM_2,  EMMC_BANK1_NORSRAM_3 or EMMC_BANK1_NORSRAM_4 */
    else
    {
        EMMC_Bank1->SNCTRL_T[bank] = 0x000030D2;
    }
    EMMC_Bank1->SNCTRL_T[bank + 1] = 0x0FFFFFFF;
    EMMC_Bank1E->WRTTIM[bank] = 0x0FFFFFFF;
}

/*!
 * @brief     Rest the EMMMC NAND Banks registers
 *
 * @param     bank: Selects the EMMMC Bank.
 *                  The parameter can be one of following values:
 *                  @arg EMMC_BANK2_NAND: FSMC Bank2 NAND
 *                  @arg EMMC_BANK3_NAND: FSMC Bank3 NAND
 *
 * @retval    None
 */
void EMMC_ResetNAND(EMMC_BANK_NAND_T bank)
{
    if(bank == EMMC_BANK2_NAND)
    {
        /** Set the EMMC_Bank2 registers to their reset values */
        EMMC_Bank2->CTRL2 = 0x00000018;
        EMMC_Bank2->STSINT2 = 0x00000040;
        EMMC_Bank2->CMSTIM2 = 0xFCFCFCFC;
        EMMC_Bank2->AMSTIM2 = 0xFCFCFCFC;
    }
    /** EMMC_BANK3_NAND */
    else
    {
        /** Set the EMMC_Bank3 registers to their reset values */
        EMMC_Bank3->CTRL3 = 0x00000018;
        EMMC_Bank3->STSINT3 = 0x00000040;
        EMMC_Bank3->CMSTIM3 = 0xFCFCFCFC;
        EMMC_Bank3->AMSTIM3 = 0xFCFCFCFC;
    }
}

/*!
 * @brief     Reset the EMMMC PCCARD Banks registers
 *
 * @param     None
 *
 * @retval    None
 */
void EMMC_ResetPCCard(void)
{
    /** Set the EMMC_Bank4 registers to their reset values */
    EMMC_Bank4->CTRL4 = 0x00000018;
    EMMC_Bank4->STSINT4 = 0x00000040;
    EMMC_Bank4->CMSTIM4 = 0xFCFCFCFC;
    EMMC_Bank4->AMSTIM4 = 0xFCFCFCFC;
    EMMC_Bank4->IOSTIM4 = 0xFCFCFCFC;
}

/*!
 * @brief     Config the EMMC NOR/SRAM Banks according to the specified parameters in the emmcNORSRAMConfig.
 *
 * @param     emmcNORSRAMConfig: Point to a EMMC_NORSRAMConfig_T structure
 *
 * @retval    None
 */
void EMMC_ConfigNORSRAM(EMMC_NORSRAMConfig_T* emmcNORSRAMConfig)
{
    /** Bank1 NOR/SRAM control register configuration */
    EMMC_Bank1->SNCTRL_T[emmcNORSRAMConfig->bank] =
        (uint32_t)emmcNORSRAMConfig->dataAddressMux |
        emmcNORSRAMConfig->memoryType |
        emmcNORSRAMConfig->memoryDataWidth |
        emmcNORSRAMConfig->burstAcceesMode |
        emmcNORSRAMConfig->asynchronousWait |
        emmcNORSRAMConfig->waitSignalPolarity |
        emmcNORSRAMConfig->wrapMode |
        emmcNORSRAMConfig->waitSignalActive |
        emmcNORSRAMConfig->writeOperation |
        emmcNORSRAMConfig->waiteSignal |
        emmcNORSRAMConfig->extendedMode |
        emmcNORSRAMConfig->writeBurst;

    if(emmcNORSRAMConfig->memoryType == EMMC_MEMORY_TYPE_NOR)
    {
        EMMC_Bank1->SNCTRL_T[emmcNORSRAMConfig->bank] |= 0x00000040;
    }

    /** Bank1 NOR/SRAM timing register configuration */
    EMMC_Bank1->SNCTRL_T[emmcNORSRAMConfig->bank + 1] =
        (uint32_t)emmcNORSRAMConfig->readWriteTimingStruct->addressSetupTime |
        (emmcNORSRAMConfig->readWriteTimingStruct->addressHodeTime << 4) |
        (emmcNORSRAMConfig->readWriteTimingStruct->dataSetupTime << 8) |
        (emmcNORSRAMConfig->readWriteTimingStruct->busTurnaroundTime << 16) |
        (emmcNORSRAMConfig->readWriteTimingStruct->clockDivision << 20) |
        (emmcNORSRAMConfig->readWriteTimingStruct->dataLatency << 24) |
        emmcNORSRAMConfig->readWriteTimingStruct->accessMode;

    /** Bank1 NOR/SRAM timing register for write configuration, if extended mode is used */
    if(emmcNORSRAMConfig->extendedMode == EMMC_EXTENDEN_MODE_ENABLE)
    {
        EMMC_Bank1E->WRTTIM[emmcNORSRAMConfig->bank] =
            (uint32_t)emmcNORSRAMConfig->writeTimingStruct->addressSetupTime |
            (emmcNORSRAMConfig->writeTimingStruct->addressHodeTime << 4) |
            (emmcNORSRAMConfig->writeTimingStruct->dataSetupTime << 8) |
            (emmcNORSRAMConfig->writeTimingStruct->clockDivision << 20) |
            (emmcNORSRAMConfig->writeTimingStruct->dataLatency << 24) |
            emmcNORSRAMConfig->writeTimingStruct->accessMode;
    }
    else
    {
        EMMC_Bank1E->WRTTIM[emmcNORSRAMConfig->bank] = 0x0FFFFFFF;
    }
}

/*!
 * @brief     Config the EMMC NAND Banks according to the specified parameters in the emmcNANDConfig.
 *
 * @param     emmcNANDConfig : Point to a EMMC_NANDConfig_T structure.
 *
 * @retval    None
 */
void EMMC_ConfigNAND(EMMC_NANDConfig_T* emmcNANDConfig)
{
    uint32_t tmppcr = 0x00000000, tmppmem = 0x00000000, tmppatt = 0x00000000;

